<?php

namespace Jetfuel\Ghfpay\Constants;

class Bank
{
    /**
     * 招商銀行
     */
    const CMB = '招商银行';

    /**
     * 中國工商銀行
     */
    const ICBC = '工商银行';

    /**
     * 中國建設銀行
     */
    const CCB = '建设银行';

    /**
     * 中國銀行
     */
    const BOC = '中国银行';

    /**
     * 中國農業銀行
     */
    const ABC = '农业银行';

    /**
     * 上海浦東發展銀行
     */
    const SPDB = '浦发银行';

    /**
     * 廣發銀行
     */
    const CGB = '广发银行';

    /**
     * 中信銀行
     */
    const CITIC = '中信银行';

    /**
     * 光大銀行
     */
    const CEB = '光大银行';

    /**
     * 興業銀行
     */
    const CIB = '兴业银行';

    /**
     * 華夏銀行
     */
    const HXB = '华夏银行';

    /**
     * 中國郵政儲蓄銀行
     */
    const PSBC = '邮储银行';

    const BANK_CODE = [
        '工商银行' => '102',
        '农业银行' => '103',
        '中国银行' => '104',
        '建设银行' => '105',
        '中信银行' => '302',
        '光大银行' => '303',
        '华夏银行' => '304',
        '广发银行' => '306',
        '招商银行' => '308',
        '兴业银行' => '309',
        '浦发银行' => '310',
        '邮储银行' => '403',
    ];

}
